{"config": {"name": "sequential_1", "layers": [{"config": {"name": "lambda_1", "output_shape": null, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "arguments": {}, "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA07p/wAAAGcAAAAAAADgP6kA\nKQHaAXhyAgAAAHICAAAA+jQvaG9tZS93b3Jrc3BhY2UvQ2FyTkQtQmVoYXZpb3JhbC1DbG9uaW5n\nLVAzL21vZGVsLnB52gg8bGFtYmRhPg4AAADzAAAAAA==\n", null, null], "output_shape_type": "raw", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"name": "conv2d_1", "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "activity_regularizer": null, "kernel_size": [5, 5], "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "filters": 24, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "conv2d_2", "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "activity_regularizer": null, "kernel_size": [5, 5], "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "filters": 36, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "conv2d_3", "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "activity_regularizer": null, "kernel_size": [5, 5], "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "filters": 48, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "conv2d_4", "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "conv2d_5", "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "data_format": "channels_last", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 80, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_1", "rate": 0.5, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 40, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_2", "rate": 0.5, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 16, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_3", "rate": 0.5, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_4", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 10, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_5", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "use_bias": true, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}